Autodesk.Navisworks.Api.Plugins.EventWatcherPlugin
Differs fom other plugin types in that the plugin is not delay loaded.
A typical implementation will subscribe to some API events in
OnLoaded and
unsubscribe in OnUnloading.

Autodesk.Navisworks.Api.Plugins.EventWatcherPlugin.#ctor
Default constructor for a EventWatcherPlugin

Autodesk.Navisworks.Api.Plugins.EventWatcherPlugin.OnLoaded
Called once immediately after the plugin has been loaded (created).
Default implementation does nothing.
This is a good place to subscribe to API events.

Autodesk.Navisworks.Api.Plugins.EventWatcherPlugin.OnUnloading
Called once just before the plugin is unloaded. If the plugin implements
IDisposable, then
Dispose will be called immediately after the plugin is unloaded.
Plugins are typically unloaded at application shutdown or when the end user has disabled a plugin.
Default implementation does nothing.
This is a good place to unsubscribe from API events.